<script setup lang="ts">

</script>

<template>
  <h1>灵动MC的三周目</h1>
  <p>
    2020年2月开始，由于不可说的秘密，服务器莫名其妙的复活了。来自东北大学的Wsbz、Neboer、Krusl、Hare、00kamisama00等玩家加入。Groundhog在此时结识Neboer。
  </p>
  <p>
    灵动MC在这期间快速的成长起来，许多新的玩家加入服务器。服务器的总据点从临时赶工的小石头屋变成了Neboer建设的一栋大楼“没有窗户的大楼”，然后又在大楼附近盖了一栋新的大楼，新的设施不断的建设出来，感谢肝帝00kamisama00，服务器有了各种生产机器，还有一个红石计时器。
  </p>
  <p>
    灵动MC的派对文化在这里发展起来，在三周目期间服务器举办了多次的派对，大家一起上线，互相投掷雪球、鸡蛋等物品，一起在大楼的大厅里自由的蹦蹦跳跳，吃蛋糕，放音乐，合影等等，热闹非凡。大楼也不断做着各种装饰，每周换一次内墙的风格，比如末地风格、海晶风格、橡木风格等等。这个时候服务器和管理员都是东北大学先锋网络中心网络部的成员，在此后的很长一段时间里服务器都部署在这个服务器上。广场附近还盖了居酒屋，用陶瓦装饰了一栋旧楼，在主城的上空建立了滑冰道……很多人都为各种工程做出了自己的贡献。
  </p>
  <p>
    在此期间灵动MC里还出现了很多观光客，大多数的观光客只是偶尔登录一下，或者三五成群拉来几个伙伴。但是在这期间服务器也被熊过一次，有人在大楼里铺放了TNT然后引燃，造成了不小的损失。这件事情也刺激我们逐渐完善自己的安全措施，包括引入各种破坏记录插件来在事故后第一时间回滚某个玩家的操作。
  </p>
  <p>
    此后，灵动MC再次陷入沉寂。
  </p>
</template>

<style scoped lang="scss">
h1, p {
  display: flex;
  justify-content: left;
  text-align: left;
  margin-top: 16px;
  margin-bottom: 16px;
  line-height: 1.7;
  font-size: 16px;
}
h1 {
  font-size: 2.2rem;
  border-bottom: 1px solid #ebedef;
}
</style>