<script setup lang="ts">

</script>

<template>
  <h1>
    欢迎加入灵动MC大家庭！
  </h1>
  <p>
    你好，我们是灵动MC，一个有爱的公益mc服务器！
  </p>
  <p>
    如果你是一个mc爱好者，渴望纯粹的原版客户生存体验，想要结识更多志同道合的爱好者，并希望有一个良好的游戏环境和专业负责的维护人员，灵动MC绝对是你的不二之选！
  </p>
  <h1>
    我们的优势
  </h1>
  <p>
    灵动MC的维护者都是有多年公益服运维经验的专业人员，从代码到游戏，我们都有较深的了解。我们自己租服务器、开发了插件、搭建了平台，只为找到更多热爱mc的小伙伴们。
  </p>
  <p>
    灵动MC是一个完全的公益服务器，我们有足够的实力长期免费维护这个服务器，不需要任何赞助和广告，并且我们也不欢迎利用公益服务器的任何直接或间接的获利行为，放心游戏，这里很纯粹！
  </p>
  <p>
    灵动MC有完善的安全措施，防御来自互联网的潜在攻击。我们使用的高防服务器可以抵御一定规模的DDOS攻击，我们的身份验证机制可以保证账号的安全性，服务器定期备份并且有防熊服插件，再加上用户协议对玩家的设计和劳动成果的保障，形成了闭环的安全保护措施。这套措施可以让我们的用户放心进行游戏，不会面临各种风险。
  </p>
  <p>
    灵动MC保护用户的隐私，在这里注册几乎不需要任何信息，我们也不会记录、更不会利用您的信息。
  </p>
  <p>
    灵动MC采用高性能、大带宽的服务器，理论最大可以同时承载15人在线，采用Paper作为服务端，保证了玩家的游戏体验。
  </p>
  <p>
    灵动MC是一个友善的社区，我们的玩家都很热心，你一定可以和我们玩得开心！
  </p>
  <h1>
    我们的愿望
  </h1>
  <p>
    灵动MC的维护者都有一个共同的朴素愿望，那就是希望灵动MC可以越办越好，大家都来玩呀！
  </p>
  <p>灵动Minecraft团队</p>
  <div style="height: 30px"></div>
</template>

<style scoped lang="scss">
h1, p {
  display: flex;
  justify-content: left;
  text-align: left;
  margin-top: 16px;
  margin-bottom: 16px;
  line-height: 1.7;
  font-size: 16px;
}
h1 {
  font-size: 2.2rem;
}
</style>